<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
    'title'       => 'Пошук',
    'clear'      =>  'Очистити',
    'submit'      => 'Шукати',
    'results'     => 'Знайдено',
    
    
    'header'     => 'Пошук за реквiзитами (мiнiмальна довжина слова 3 символи)',
    
    'search'     => 'Стрічка пошуку',
    
    
    
    'field'	=> array('description'	=> 'Місце пошуку',
    				'data'	=> array( '0' => 'Всюди', 
    						'1' => 'В назві', 
    						'2' => 'В анонсі',
    						'3' => 'В тексті')	
    
    				),
    				
    				
    				
    'date'	=> array('description'	=> 'Дата публікації',
    
    				'type'	=> array('1'=>'дорівнює',
    								 '2'=>'раніше за',
    								 '3'=>'пізніше за'),
    
    				'months'	=> array( '1' => '1 - Січень', 
    						'2' => '2 - Лютий', 
    						'3' => '3 - Березень', 
    						'4' => '4 - Квітень', 
    						'5' => '5 - Травень', 
    						'6' => '6 - Червень', 
    						'7' => '7 - Липень', 
    						'8' => '8 - Серпень', 
    						'9' => '9 - Вересень', 
    						'10' => '10 - Жовтень', 
    						'11' => '11 - Листопад', 
    						'12' => '12 - Грудень')
    
    				),
    
    				
    'topics_description'	=> 'Розділ',     				
    
    'sort'	=> array('description'	=> 'Сортування',
    				'data'	=> array('1' => 'за релевантністю', 
									'2' => 'по даті публікації')
    
    				),    				
    				
);
