<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(

    'months_first' => array(
        '01' => 'Січень',
        '02' => 'Лютий',
        '03' => 'Березень',
        '04' => 'Квітень',
        '05' => 'Травень',
        '06' => 'Червень',
        '07' => 'Липень',
        '08' => 'Серпень',
        '09' => 'Вересень',
        '10' => 'Жовтень',
        '11' => 'Листопад',
        '12' => 'Грудень'
    ),  
    
    'months' => array(
        '01' => 'січня',
        '02' => 'лютого',
        '03' => 'березня',
        '04' => 'квітня',
        '05' => 'травня',
        '06' => 'червня',
        '07' => 'липня',
        '08' => 'серпня',
        '09' => 'вересня',
        '10' => 'жовтня',
        '11' => 'листопада',
        '12' => 'грудня'
    ),      
        
    'week_day_long' => array(
        '1' => 'Понеділок',
        '2' => 'Вівторок',
        '3' => 'Середа',
        '4' => 'Четвер',
        '5' => 'П\'ятниця',
        '6' => 'Субота',
        '7' => 'Неділя'

    ),        
    'week_day_short' => array(
        '1' => 'Пн',
        '2' => 'Вт',
        '3' => 'Ср',
        '4' => 'Чт',
        '5' => 'Пт',
        '6' => 'Сб',
        '7' => 'Нд'

    ),        
    
    
);
