<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'there_can_be_only_one' => 'Наличие более, чем одного экземпляра Kohana, в пределах одного запроса страницы, невозможно',
	'uncaught_exception'    => 'Не пойманное %s: %s в файле %s, на строке %s',
	'invalid_method'        => 'Вызов метода %s из файла %s невозможен',
	'invalid_property'      => 'Свойство %s не входит в состав класса %s.',
	'log_dir_unwritable'    => 'Директория для хранения журналов, %s, не доступна для записи',
	'resource_not_found'    => 'Запрошенный %s, %s, не найден',
	'invalid_filetype'      => 'Запрошенный тип файла, .%s, не разрешён конфигурацией видов',
	'view_set_filename'     => 'Необходимо задать файл вида перед вызовом render()',
	'no_default_route'      => 'Установите путь по умолчанию в файле config/routes.php.',
	'no_controller'         => 'Kohana не удалось найти контроллер для обработки этого запроса: %s',
	'page_not_found'        => 'Запрошенная страница, %s, не найдена.',
	'stats_footer'          => 'Загружено за {execution_time} секунд, используя {memory_usage} памяти. Сгенерировано Kohana v{kohana_version}.',
	'error_file_line'       => '<tt>%s <strong>[%s]:</strong></tt>',
	'stack_trace'           => 'Стек вызовов',
	'generic_error'         => 'Не удалось обработать запрос',	

	// Drivers
	'driver_implements'     => 'Драйвер %s библиотеки %s не реализует интерфейс %s',
	'driver_not_found'      => 'Драйвер %s библиотеки %s не найден',

	// Resource names
	'config'                => 'конфигурация',
	'controller'            => 'контроллер',
	'helper'                => 'помощник',
	'library'               => 'библиотека',
	'driver'                => 'драйвер',
	'model'                 => 'модель',
	'view'                  => 'вид',



	'errors_disabled'       => array(
		'title' => 'Офіційний портал Верховної Ради України',
		'header1' => 'На жаль, сторінку не знайдено',
		'header2' => 'Офіційний вебпортал',
		'msg1' => 'Помилка 404',
		'msg2' => 'Сторінка, яку ви намагаєтесь знайти не існує, або була видалена. Також можливо, що вона тепер знаходиться за новою адресою, скористайтесь пошуком, щоб знайти її.',
        'msg3' => 'Можливі причини',
        'list' => array('невірно набрана адреса', 'такої сторінки ніколи не було на цьому сайті', 'така сторінка була, але її більше немає за цією адресою'),
        'link' => 'Ви можете перейти на <a href="/">головну сторінку</a>, подивитись <a href="/map">мапу сайту</a>, або скористатися пошуком по сайту',
        'searched' => 'Знайти',
		'extended' => 'До розширеного пошуку',
		'search_url' => '/search'




   ),
);
