<?php

$lang = array
(
	'theme' => Array
	(
		'required' => 'Будь ласка введіть тему повідомлення',
		'default' => 'Будь ласка введіть тему повідомлення',
		'length'	=> 'Тема повідомлення повинна перевищувати 10 символів'
	),
	'name' => Array
	(
		'required' => 'Будь ласка введіть ваше Прізвище та Ім\'я',
		'default' => 'Неправильне ім\'я',
		'length'	=> 'Ім\'я повинне перевищувати 2 символів'
	),
	'text' => Array
	(
		'required' => 'Будь ласка введіть текст повідомлення',
		'default' => 'Будь ласка введіть текст повідомлення',
		'length'	=> 'Текст повідомлення повинен бути не менше 25, але не більше 1000 символів'
	),
	'email' => Array
	(
		'required' => 'Будь ласка вкажіть E-mail',
		'email' => 'Формат E-mail не правильний',
		'default' => 'Формат E-mail не правильний'
	),	
	'captcha' => Array
	(
		'required' => 'Введіть код перевірки',
		'default' => '<b> Невірний код</b>',
		'length'	=> 'Код перевірки повинен складатися з 6 символів'
	),
	
	'cookie' => 'Антифлуд 30сек',
	
	'badWords' => 'В тексті помічені заборонені слова',
	
	'sendOk'	=> '<span class="succes-message">Ваше повідомлення успішно відіслане</span>',
	
	'sendProblems' => 'При відправленні повідомлення виникли проблеми'
	
);
