<?php

$lang = array
    (
    'zminame' => Array
        (
        'required' => 'Будь ласка введіть назву ЗМІ',
        'default' => 'Будь ласка введіть назву ЗМІ',
        'length' => 'Назва ЗМІ повинна бути більше 8 символів'
    ),
    'name' => Array
        (
        'required' => 'Будь ласка введіть ваше Ім\'я',
        'default' => 'Неправильне ім\'я',
        'length' => 'Ім\'я повинне бути більше 3 символів'
    ),
    'lname' => Array
        (
        'required' => 'Будь ласка введіть ваше Прізвище',
        'default' => 'Неправильне Прізвище',
        'length' => 'Прізвище повинне бути більше 3 символів'
    ),
    'text' => Array
        (
        'required' => 'Будь ласка введіть текст повідомлення',
        'default' => 'Будь ласка введіть текст повідомлення',
        'length' => 'Текст повідомлення повинен бути не менше 25, але не більше 1000 символів'
    ),
    'eventdate' => Array
        (
        'required' => 'Будь ласка введіть дату події',
        'default' => 'Будь ласка введіть дату події',
//        'length' => 'Текст повідомлення повинен бути не менше 25, але не більше 1000 символів'
    ),
    'eventname' => Array
        (
        'required' => 'Будь ласка оберіть подію',
        'default' => 'Будь ласка введіть назву події',
        'length' => 'Назва події має бути 25 - 255 символів'
    ),
    'email' => Array
        (
        'required' => 'Будь ласка вкажіть адресу електронної пошти',
        'email' => 'Формат адреси електронної пошти не правильний',
        'default' => 'Формат адреси електронної пошти не правильний'
    ),
    'phone' => Array
        (
        'required' => 'Будь ласка вкажіть номер телефона',
        'default' => 'Будь ласка вкажіть номер телефона',
        'length' => 'Номер телефона повинен бути не менше 10, але не більше 20 символів'
    ),
    'captcha' => Array
        (
        'required' => 'Введіть код перевірки',
        'default' => 'Невірно набраний текст',
        'length' => 'Код перевірки повинен складатися з 6 символів'
    ),
    'cookie' => 'Антифлуд 30сек',
    'badWords' => 'В тексті помічені заборонені слова',
    'sendOk' => 'Заявку на разову акредитацію надіслано',
    'sendProblems' => 'При відправленні повідомлення виникли проблеми'
);
