<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
    'module'            => 'Зворотний зв\'язок з програмно-технічної підтримки',    
    'name'              => 'Прізвище та Ім\'я',
    'theme'		=> 'Тема повідомлення',
    'email'             => 'E-mail',
    'post'		=> 'Поштова адреса',
    'phone'		=> 'Телефон',
    'recipient'         => 'Одержувач повідомлення',
    'message'           => 'Текст повідомлення',
    'send'              => 'Надіслати',
    'captcha'           => 'Введіть текст, зображений на малюнку',
);
