<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
    'module'            => 'Зворотний зв\'язок з програмно-технічної підтримки',    
    'name'              => 'Ім\'я та по батькові',
    'lname'             => 'Прізвище',
    'pname'             => 'По батькові',
    'zminame'		=> 'Назва ЗМІ та посада',
    'email'             => 'Електронна адреса',
    'eventdate'		=> 'Оберіть дату події',
    'eventname'		=> 'Оберіть подію, яку бажаєте відвідати',
    'phone'		=> 'Телефон',
    'recipient'         => 'Одержувач повідомлення',
    'message'           => 'Хочете додати інформацію?',
    'send'              => 'Надіслати',
    'captcha'           => 'Введіть текст, зображений на малюнку',
);
