<?php

defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
    (
    'title' => 'Календар засідань',
    'search' => 'Пошук',
    'doc' => 'Документ',
    'types' => array(
        '1' => 'Стенограми пленарних засідань',
        '2' => 'Порядки денні пленарних засідань',
        '3' => 'Оперативна інформація про результати розгляду питань порядку денного на пленарних засіданнях',
        '4' => 'Стенограми погоджувальних рад',
    ),
    'type' => array(
        '1' => 'Стенограма пленарного засідання',
        '2' => 'Порядок денний пленарного засідання',
        '3' => 'Оперативна інформація про результати розгляду питань порядку денного',
        '4' => 'Стенограма погоджувальної ради',
        '5' => '',
    ),
    'infosuport' => array(
        '1' => 'Iнформаційна підтримка — Головне управління документального забезпечення',
        '2' => 'Iнформаційна підтримка — Головне організаційне управління',
        '3' => 'Iнформаційна підтримка — Головне організаційне управління',
        '4' => 'Iнформаційна підтримка — Головне управління документального забезпечення',
    )
);
