<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
    'title'         => 'Підписка на анонси',
    'topics_sel'    => 'Розділи підписки',
    'email'         => 'E-mail',
    'send'          => 'Підписатись',
    'captcha'       => 'Введіть текст, який зображений на малюнку',
    
    'subscribed'    => 'Підтвердження підписки відправлено на Ваш e-mail',
    
    
    'confirm_message'   => array( 'subject'		=>      'Підтвердження підписки на анонси новин вебпорталу Верховної Ради України',
    				'title'			=>	'Підписка на анонси новин вебпорталу Верховної Ради України',
    				'base_msg'		=>	'Для підтвердження підписки перейдіть за наступним посиланням:',
    				'ignore_msg'            =>	'В іншому випадку проігноруйте цей лист'),
    							
   'apply_confirm' 	=> array('accept_msg_add'       =>      'Підтвердження підписки прийнято',
   				'accept_msg_del'        =>      'Видалення підписки прийнято',
   				'error_msg'             =>      'Помилковий код підтвердження'),
    							
   							 
    'send_anons'        => array('subject'		=>      'Розсилка анонсів новин вебпорталу Верховної Ради України',
				'cancel_subscribe'	=>      'Для відміни підписки перейдіть за наступним посиланням:')
   							 
);
