<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(

    'title' => 'Календарь заседаний',
    'search' => 'Поиск',
    'doc' => 'Документ',
   
    
    'types' => array(
        '1' => 'Стенограммы пленарных заседаний',
        '2' => 'Порядок дня пленарных заседаний',
        '3' => 'Оперативная информация о результатах рассмотрения вопросов повестки дня на пленарных заседаниях',
        
    ),
    
    'type' => array(
        '1' => 'Стенограмма пленарного заседания',
        '2' => 'Порядок дня пленарного заседания',
        '3' => 'Оперативная информация о результатах рассмотрения вопросов повестки дня',
        
    )        
    
);
