<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'title'				=> 'Подписка на анонсы новостей',
	'tree_topics'       => 'Разделы подписки',
    'email'             => 'E-mail',
    'send'              => 'Подписаться на анонсы',
    'captcha'           => 'Введите текст изображенный на рисунке',
    
    'subscribed'              => 'Подтверждение подписки отправлено на Ваш e-mail',
    
    
    'confirm_message' => array( 'subject'		=> 'Подтверждение подписки на анонсы новостей сайта',
    							'title'			=>	'Подписка на анонсы новостей',
    							'base_msg'		=>	'Для подтверждения подписки перейдите по следующей ссилке:',
    							'ignore_msg'	=>	'Иначе проигнорируйте данное письмо'),
    							
   'apply_confirm' 	=> array('accept_msg_add'=>'Подтверждение подписки принято',
   							 'accept_msg_del'=>'Удаление подписки принято',
   							 'error_msg' => 'Неверный код подтверждения'),
    							
   							 
	'send_anons'   => array('subject'			=> 'Рассылка анонсов новостей (официальный портал ВР)',
							'cancel_subscribe'	=> 'Для отмены подписки перейдите по следующей ссылке:')
   							 
);
