<?php

$lang = array
(

	'name' => Array
	(
		'required' => 'Будь ласка введіть ваше П.І.Б',
		'default' => 'Неправильне ім\'я',
		'length'	=> 'Ім\'я повинне бути більше 3 символів',
		'badword' => 'В тексті помічені заборонені слова'
	),
	'text' => Array
	(
		'required' => 'Будь ласка введіть текст повідомлення',
		'default' => 'Будь ласка введіть текст повідомлення',
		'length'	=> 'Текст повідомлення повинен містити більше 25 символів',
		'badword' => 'В тексті помічені заборонені слова'
	),
	'captcha' => Array
	(
		'required' => 'Введіть код перевірки',
		'default' => 'Не правильний код перевірки',
		'length'	=> 'Код перевірки повинен складатися з 6 символів'
	),
	'other' => Array
	(
		'flood' => 'Антифлуд 30сек',
	)	
	
	
	
	
	
);