<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
    'title'       => 'Пошук',
    'clear'      =>  'Очистити',
    'submit'      => 'Шукати',
    'results'     => 'Знайдено',
    
    
    'header'     => 'Пошук за реквiзитами (мiнiмальна довжина слова 3 символи)',
    
    'str_search'     => 'Текст для пошуку',
    
    
    
    'field'	=> array('description'	=> 'Місце пошуку',
    				'data'	=> array( '0' => 'Всюди', 
    						'1' => 'У заголовку', 
    						'2' => 'В анонсі',
    						'3' => 'У тексті')	
    
    				),
    				
    				
    				
    'date'	=> array('description'	=> 'Дата публікації',
    
    				'type'	=> array('1'=>'дорівнює',
    								 '2'=>'раніше ніж',
    								 '3'=>'пізніше за'),
    
    				'months'	=> array( '1' => 'Січень',
    						'2' => 'Лютий',
    						'3' => 'Березень',
    						'4' => 'Квітень',
    						'5' => 'Травень',
    						'6' => 'Червень',
    						'7' => 'Липень',
    						'8' => 'Серпень',
    						'9' => 'Вересень',
    						'10' => 'Жовтень',
    						'11' => 'Листопад',
    						'12' => 'Грудень')
    
    				),
    
    				
    'topics_description'	=> 'Розділ',     				
    
    'sort'	=> array('description'	=> 'Сортування',
    				'data'	=> array('1' => 'за релевантністю', 
									'2' => 'по даті публікації')
    
    				),    				
    				
);
