<?php

$lang = array
(
	'email' => Array
	(
		'required'  => 'Будь ласка вкажіть свою адресу електронної пошти',
		'email'     => 'Формат адреси електронної пошти не правильний',
		'default'   => 'Формат адреси електронної пошти не правильний',
		'uniq'      => 'На даний e-mail вже існує підписка'
	),
	'captcha' => Array
	(
		'required'  => 'Введіть код перевірки',
		'default'   => 'Не правильний код перевірки',
		'length'    => 'Код перевірки повинен складатися з 6 символів'
	),
	'topics_sel' => Array
	(
		'required'  => 'Будь ласка вкажіть розділи підписки'
		
	),	
	
	
	'cookie'            => 'Антифлуд 30сек'
);