<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
  'generic_error' => 'Сторінку не знайдено'
, 'errors_disabled' => '<p>Сторінка, яку ви запросили не знайдена, можливо вона була вилучена або перейменована. Також                            може бути неправильно зазначена адреса сторінки.</p>
                        <p>Спробуйте знайди потрібну інформацію на <a href="/map/">карті сайту</a> або перейдіть на <a                            href="/">головну сторінку</a> сайта.</p>'
)
?>
