<?php

$lang = array
(
	'theme' => Array
	(
		'required' => 'Будь ласка введіть тему повідомлення',
		'default' => 'Будь ласка введіть тему повідомлення',
		'length'	=> 'Тема повідомлення повинна бути більшою 10 символів'
	),
	'name' => Array
	(
		'required' => 'Будь ласка введіть ваше П.І.Б',
		'default' => 'Неправильне ім\'я',
		'length'	=> 'Ім\'я повинне бути більше 3 символів'
	),
	'text' => Array
	(
		'required' => 'Будь ласка введіть текст повідомлення',
		'default' => 'Будь ласка введіть текст повідомлення',
		'length'	=> 'Текст повідомлення повинен бути не меньше 25, але не більше 1000 символів'
	),
	'email' => Array
	(
		'required' => 'Будь ласка вкажіть свою адресу електронної пошти',
		'email' => 'Формат адреси електронної пошти не правильний',
		'default' => 'Формат адреси електронної пошти не правильний'
	),	
	'captcha' => Array
	(
		'required' => 'Введіть код перевірки',
		'default' => 'Неправильний код перевірки',
		'length'	=> 'Код перевірки повинен складатися з 6 символів'
	),
	
	'cookie' => 'Антифлуд 30сек',
	
	'badWords' => 'В тексті помічені заборонені слова',
	
	'sendOk'	=> 'Ваше повідомлення успішно відіслане',
	
	'sendProblems' => 'При відправленні повідомлення виникли проблеми'
	
);
