<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
	'title'				=> 'Підписка на анонси новин',
	'topics_sel'       => 'Розділи підписки',
    'email'             => 'E-mail',
    'send'              => 'Підписатись на анонси',
    'captcha'           => 'Введіть текст зображений на малюнку',
    
    'subscribed'              => 'Підтвердження підписки відправлено на Ваш e-mail',
    
    
    'confirm_message' => array( 'subject'		=> 'Підтвердження підписки на анонси новин сайту ВР',
    							'title'			=>	'Підписка на анонси новин сайт ВР',
    							'base_msg'		=>	'Для підтвердження підписки перейдіть по наступній ссилці:',
    							'ignore_msg'	=>	'В іншому випадку проігноруйте даний лист'),
    							
   'apply_confirm' 	=> array('accept_msg_add'=>'Підтвердження підписки прийнято',
   							 'accept_msg_del'=>'Видалення підписки прийнято',
   							 'error_msg' => 'Помилковий код підтвердження'),
    							
   							 
	'send_anons'   => array('subject'			=> 'Розсилка анонсів новин (офіційний сайт ВР)',
							'cancel_subscribe'	=> 'Для відміни підписки перейдіть по наступній ссилці:')
   							 
);
