<?php

$lang = array
(
	'name' => Array
	(
		'required' => 'Будь ласка заповніть заголовок запитання',
		'default' => 'Заголовок запитання не є правильним',
		'checkBadWords'	=> 'В заголовку помічені заборонені слова',
		'length'	=> 'Заголовок запитання повинен бути більше ніж 5 символів і меньше 255'
	),
	'email' => Array
	(
		'required' => 'Будь ласка вкажіть свою адресу електронної пошти',
		'email' => 'Формат адреси електронної пошти не правильний',
		'default' => 'Формат адреси електронної пошти не правильний'
	),
	'username' => array
	(
		'required' => 'Будь ласка введіть своє ім`я',
		'default' => 'Ви не правильно вказали ПІБ',
		'checkBadWords'	=> 'В вашому імені помічені заборонені слова',
		'length'	=> 'ПІБ повиненне бути більше ніж 2 символа і меньше 255'
	),
	'question' => Array
	(
		'required' => 'Будь ласка вкажіть текст запитання',
		'checkBadWords'	=> 'В тексті помічені заборонені слова',
		'default' => 'Не правильне запитання',
	),
	'captcha' => Array
	(
		'required' => 'Введіть код перевірки',
		'default' => 'Не правильний код перевірки',
		'length'	=> 'Код перевірки повинен складатися з 6 символів'
	),
	
	'cookie'	=> 'Антифлуд 30сек',
	'item_not_found'	=> 'Невірно вказаний ідентифікатор запитання',
	'no_answers_found'	=> 'Немає відповідей',
	'badWords' => 'В тексті помічені заборонені слова',
	'email_subject'	=> 'Інтернет Приймальна Верховної ради України',
	'email_question'	=> 'Ваше запитання:',
	'answer'	=> 'Відповідь:',
	'answer_username'	=> 'Відповідальна особа:'
);