

<?php defined('SYSPATH') OR die('No direct access allowed.');
                                 


// Фільтр  пленарних засідань 

$config['plenday_id'] = 
          '1' //пленарні засідання
     //   . ',2' //Робота в комітетах і фракціях
     //   . ',3' //Робота з виборцями
        . ',4' //Пленарне засідання + робота у комітетах
        . ',5' //Година запитань до Уряду
        . ',6' //Погоджувальна рада
        . ',7'  //Погоджувальна рада + пленарне засідання
        . ',8'  //Позачергове пленарне засідання
        . ',9'  //Чергове та позачергове пленарні засідання
        . ',10' //Погоджувальна рада + позачергове пленарне засідання
        . ',11'  //Година запитань до Уряду + позачергове пленарне засідання

?>