<?php defined('SYSPATH') OR die('No direct access allowed.');

$lang = array
(
    'title'       => 'Поиск',
    'clear'      =>  'Очистить',
    'submit'      => 'Искать',
    'results'     => 'Найдено',
    
    
    'header'     => 'Поиск по реквизитам (минимальная длина слова 3 символа)',
    
    'str_search'     => 'Текст для поиска',
    
    
    
    'field'	=> array('description'	=> 'Место поиска',
    				'data'	=> array( '0' => 'Всюду', 
    						'1' => 'В заголовке', 
    						'2' => 'В анонсе',
    						'3' => 'В тексте')	
    
    				),
    				
    				
    				
    'date'	=> array('description'	=> 'Дата публикации',
    
    				'type'	=> array('1'=>'соответствует',
    								 '2'=>'до',
    								 '3'=>'после'),
    
    				'months'	=> array( '1' => '1 - Январь', 
    						'2' => '2 - Февраль', 
    						'3' => '3 - Март', 
    						'4' => '4 - Апрель', 
    						'5' => '5 - Май', 
    						'6' => '6 - Июнь', 
    						'7' => '7 - Июль', 
    						'8' => '8 - Август', 
    						'9' => '9 - Сентябрь', 
    						'10' => '10 - Октябрь', 
    						'11' => '11 - Ноябрь', 
    						'12' => '12 - Декабрь')
    
    				),
    
    				
    'topics_description'	=> 'Раздел',     				
    
    'sort'	=> array('description'	=> 'Сортировать',
    				'data'	=> array('1' => 'по релевантности', 
									'2' => 'по дате публикации')
    
    				),    				
    				
);
