export const data = {
    const: {
        PAGE_SIZE: 25,
        STANDARD_YEAR: 2023,
        STANDARD_MONTH: 1,
        STANDARD_TYPE: 'month',
        STANDARD_PAGE: 1,
        YEAR_MIN: 2019,
        YEAR_MAX: 2023,
        MONTH_MIN: 1,
        MONTH_MAX: 12,
        DAY_MIN: 1,
        DAY_MAX: 7,
        PAGE_MIN: 1,
        PAGE_MAX: undefined
    },
    lawBase: undefined,
    colors: undefined,
    currentType: undefined,
    currentYear: undefined,
    currentMonth: undefined,
    currentDay: undefined,
    currentPage: undefined,
    monthName: ['Січень', 'Лютий', 'Березень', 'Квітень', 'Травень', 'Червень', 'Липень', 'Серпень', 'Вересень', 'Жовтень', 'Листопад', 'Грудень'],
    monthNameGen: ['Січня', 'Лютого', 'Березня', 'Квітня', 'Травня', 'Червня', 'Липня', 'Серпня', 'Вересня', 'Жовтня', 'Листопада', 'Грудня'],
    dateDayNameToIndex: {'Mon': 0, 'Tue': 1, 'Wed': 2, 'Thu': 3, 'Fri': 4, 'Sat': 5, 'Sun': 6},
    dayName: ['Понеділок', 'Вівторок', 'Середа', 'Четверг', 'П\'ятниця', 'Субота', 'Неділя'],
    dayNameShort: ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд'],
    lawSubj: ['Президент України', 'Кабінет Міністрів України', 'Народний депутат України'],
    lawSubjSign: ['П', 'У', 'Д'],
    lawSubjColor: ['text-danger', 'text-success', 'text-primary'],
    soloLineCount: 1,
    standardScrollTo: {
        target: undefined,
        behavior: 'smooth',
        block: 'nearest',
        inline: 'center'
    },
    fetchToken: {
        hash: null,
        date: [0, 0, 0]
    },
    table: {
        lawSet: undefined,
        type: 'standard',
        dateType: undefined,
        year: 0,
        month: 0,
        day: 0,
        periodCount: 0,
        itemCount: 0,
        dayCount: 0,
        startingMonth: 0,
        startingDay: 0,
        endingDate: [0, 0, 0],
        pageCount: 0,
        eventsSet: [],
        scrollTo: {
            target: undefined,
            behavior: 'smooth',
            block: 'nearest',
            inline: 'center'
        }
    },
    tableCache: {
        lawSet: undefined,
        type: 'standard',
        dateType: undefined,
        year: 0,
        month: 0,
        day: 0,
        periodCount: 0,
        itemCount: 0,
        dayCount: 0,
        startingMonth: 0,
        startingDay: 0,
        endingDate: [0, 0, 0],
        pageCount: 0,
        eventsSet: [],
        scrollTo: {
            target: undefined,
            behavior: 'smooth',
            block: 'nearest',
            inline: 'center'
        }
    },
    // Наступні 5 параметрів є типу px
    firstWidth: parseFloat(getComputedStyle(document.documentElement).getPropertyValue('--first-width')),
    standardDayWidth: parseFloat(getComputedStyle(document.documentElement).getPropertyValue('--col-width')),
    mainEventWidth: parseFloat(getComputedStyle(document.documentElement).getPropertyValue('--main-event-width')),
    soloDayWidth: parseFloat(getComputedStyle(document.documentElement).getPropertyValue('--solo-width')),
    soloEventWidth: parseFloat(getComputedStyle(document.documentElement).getPropertyValue('--solo-event-width')),
    committeeMaxWorkLength: 30, //?
    stepsParams: {
    'refine': {'text': '<i class="fa fa-undo"></i>'},
    'addit': {'text': ''},
    'again': {'text': ''},
    'register': {'text': '<i class="fa fa-arrow-right"></i>'},
    'working': {'text': '<i class="fa fa-university"></i>'},
    'order': {'text': '<i class="fa fa-list-ul"></i>'},
    'first': {'text': '<b>1</b>'},
    'second': {'text':' <b>2</b>'},
    'third': {'text': '<b>3</b>'},
    'accept': {'text': '<i class="fa fa-check"></i>'},
    'signed': {'text': '<i class="fa fa-pencil"></i>'},
    'valid': {'text': '<i class="fa fa-gavel"></i>'},
    'reject': {'text': '<i class="fa fa-times"></i>'},
    'notaccept': {'text': '<i class="fa fa-pause"></i>'},
    'urgent': {'text': '<i class="fa fa-exclamation"></i>'},
    'intern': {'text': '<i class="fa fa-globe"></i>'},
    'public': {'text': '<i class="fa fa-print"></i>'},
    'other': {'text': '<i class="fa fa-ellipsis-h"></i>'}
    },
    /*
    stateArray: [
        'Прийом',
        'Одержано проект',
        'Опрацьовується в комітеті',
        'Очікує розгляду',
        'Очікує рішення',
        'Очікує на друге читання',
        'Очікує на третє читання',
        'Готується на підпис',
        'Готується на підпис (після вето)',
        'Передано на підпис Президенту',
        'Передано на підпис Президенту (після вето)',
        'Закон підписано',
        'Закон про ратифікацію підписано',
        'Постанову підписано',
        'Акт підписано',
        'Занесено до протоколу',
        'Готується на повторне перше читання',
        'Готується на друге читання',
        'Готується на повторне друге читання',
        'Готується на третє читання',
        'Очікує на розгляд з вето Президента',
        'Готується на розгляд з вето Президента',
        'Готується на повторний розгляд після доопрацювання',
        'Знято з розгляду',
        'Заслухано та знято з розгляду',
        'Пропозиції враховано',
        'Повернуто на доопрацювання',
        'Відхилено та знято з розгляду',
        'В порядок денний не включено',
        'Розгляд відкладено'
    ],
    phaseArray: [
        'Одержано Верховною Радою',
        'Визначено Президентом як невідкладний',
        'Представлено проект',
        'Доручено підготувати',
        'Доручено внести із скороченням строку підготовки',
        'Проголосовано скороч. строку на альтерн. законопроект',
        'Передано на розгляд керівництву',
        'Направлено на розгляд Комітету',
        'Направлено до Комітету',
        'Розміщено на веб-сайті',
        'Одержано повторну резолюцію',
        'Одержано проект на заміну',
        'Одержано доопрацьований проект',
        'Одержано доопрацьований Комітетом проект',
        'Передано в тираж',
        'Включено до порядку денного',
        'Надано для ознайомлення',
        'Надано на заміну',
        'Надано для розгляду',
        'Надано висновок Комітету про розгляд',
        'Надано повторний висновок Комітету',
        'Надано з висновком Комітету про розгляд',
        'Надано доопрацьований Комітетом проект',
        'Надано висновок Комітету про відхилення',
        'Надано висновок Комітету про доопрацювання',
        'Надано висновок Комітету на зняття з розгляду',
        'Надано висновок Комітету',
        'Надано порівняльну таблицю (друге читання)',
        'Надано висновок Комітету до другого читання',
        'Надано додаткову порівняльну таблицю (друге читання)',
        'Надано порівняльну таблицю (третє читання)',
        'Надано порівняльну таблицю (після доопрацювання)',
        'Надано додаткову порівняльну таблицю (третє читання)',
        'Надані пропозиції Президента до закону',
        'Надано висновок Комітету до пропозицій Президента',
        'Надано висновок з підтримкою пропоз. Президента',
        'Надано висновок Комітету на подолання вето',
        'Надано висновок Комітету про невключення до ПД',
        'Надано висновок Комітету про включення до ПД',
        'Надано пропозиції щодо усунення неузгодженостей',
        'Надано висновок Конституційного Суду',
        'Закон прийнято',
        'Прийнято пропозиції щодо усунення неузгодженостей',
        'Акт прийнято',
        'Прийнято інше рішення',
        'Постанову прийнято',
        'Заяву прийнято',
        'Повторно прийнято з пропозиціями Президента',
        'Закон підтримано в доопрацьованій редакції',
        'Вето Президента подолано',
        'Попередньо схвалено',
        'Прийнято за основу',
        'Прийнято за основу із скороч. строку підготовки',
        'Розгляд перенесено',
        'Обговорено',
        'Передано на повторне перше читання',
        'Повернуто на доопрацювання ініціатору внесення',
        'Рішення прийнято',
        'Доручено врахувати в іншому проекті',
        'Враховано Комітетом при доопрацюванні',
        'Прийнято в другому читанні',
        'Передано на повторне друге читання',
        'Передано на повторне третє читання',
        'Проект відхилено',
        'Проект не прийнято',
        'Знято з розгляду',
        'В порядок денний не включено',
        'Питання заслухано',
        'Вето Президента не подолано',
        'Закон направлено на доопрацювання в Комітет',
        'Розгляд пропозицій Президента перенесено',
        'Закон відхилено',
        'Проект відкликано',
        'Одержано заяву про відкликання',
        'Повернуто на доопрацювання суб\'єкту',
        'Направлено на висновок Конституційного Суду',
        'Надходження до протокольного відділу',
        'Передано на візування в головний комітет',
        'Передано на підпис Голові Верховної Ради',
        'Передано на підпис Президії першої сесії',
        'Передано Голові ВРУ для офіційного оприлюднення',
        'Повернуто з підписом Голови Верховної Ради України',
        'Повернуто з підписом Голови ВРУ для оприлюднення',
        'Постанову підписано',
        'Підписано Президією першої сесії',
        'Закон направлено на підпис Президенту',
        'Закон направлено на підпис Президенту (після вето)',
        'Повернуто з підписом від Президента',
        'Повернуто з пропозиціями Президента',
        'Повернуто з вето Президента для відхилення',
        'Розсилка оформленого акту',
        'Передано для опублікування',
        'Визначено Парламентом як невідкладний',
        'Прийнято за основу із продовженням строку підготовки'
    ],
    */
    mermaidCharts: {
        svg: {
            register: ``
        },
        type: 'graph RL',
        classes: `
            classDef bold font-weight:bold;
            classDef italic font-style:italic;
            classDef title stroke:#eee,stroke-width:4px,font-size:32px;
            classDef empty fill:transparent,stroke-width:0;
            `,
        register: `
            3g:::bold
            3g:::title
            subgraph 3g["Внесення та реєстрація законопроектів у Верховній Раді України"]
            direction TB

            3deput["Народні депутати - один або скільки завгодно з правом зняття підпису"] --> 3law["ЗАКОНОПРОЕКТ"]
            3pres["Президент України"] --> 3law
            3minis["Кабінет Міністрів України"] --> 3law

            3law --> 3law_reg["Реєстрація законопроекту СРЗ (в день внесення законопроекту до ВР)"]
            3point_A["Пункт А"] ==o 3law_reg

            3law_reg --> 3head_VR["Голова ВР або його заступник (за росподілом обов'язків) повертають законопроект до СРЗ"]
            35day_reg["Не пізніше 5 днів після реєстрації з-ту"] -.- 3head_VR

            3head_VR --> 3LRS_copy["СРЗ через відділ службової реєстрації розсилає копії зазначеним у резолюції адресатам та на сайт ВРУ"]

            3LRS_copy --> 3main_com["Комітет, визначений головним (для підготовки висновку щодо включення до порядку денного та попереднього розгляду) - ГК"]
            3LRS_copy --> 3main_dep["Головне науково- експертне управління (ГНЕУ)"]
            3LRS_copy ----> 3total_com["Комітети ВРУ (згідно переліку резолюції), Комітет з питань Європейської інтеграції, Антикорупційний комітет"]
            3LRS_copy --> 3budget_com["Бюджетний комітет (щодо впливу з-ту на бюджет)"]
            3LRS_copy --> 3people_dep["Народні депутати (на початку робочого дня, наступного за днем направлення з-ту до ГК)"]
            3LRS_copy ----> 3temp_com["Тимчасова спеціальна комісія на правах головного комітету"]
            3LRS_copy ----> 3main_org_man["Головному оргуправлінню Апарату ВРУ (для контролю за проходженням)"]

            3main_com ---> 3minis_etc["Кабінету Міністрів, відповідним Міністерствам, іншим державним органам установам, організаціям та експертам за пропозицією ГК"]
            3main_com ---> 3com_misc["Деяким комітетам ВРУ - за пропозицією"]

            3minis_etc -..-> 3total_conc["Висновки, експертні висновки, пропозиції не пізніше 21-го дня з дня отримання з-ту"]
            3com_misc -.-> 3total_conc
            3main_dep ----> 3total_conc
            3budget_com -----> 3total_conc
            3com_etc["Інші комітети ВРУ - за власною ініціативою"] -.-> 3total_conc
            3people_dep -...-> 3total_conc
            3no_conc["B paзi відсутності висновків комітетів розгляд відбуваються без висновків"] -.- 3total_conc

            3total_com ~~~ 3com_etc
            3temp_com ~~~ 3no_conc

            3total_conc --> 3main_com_conc["ГК попередньо розглядає законопроект, узагальнює зауваження і пропозиції"]


            class 3point_A,3deput,3pres,3minis,35day_reg,3no_conc empty
            class 3point_A,35day_reg,3no_conc bold

            style 3main_com_conc stroke-dasharray: 10 6

            end
        `,
        order: `
            4g:::bold
            4g:::title
            subgraph 4g["Попередній розгляд законопроектів у Верховній Раді України"]
            direction TB

            4no_conc_desc["В разі відсутності висновків комітетів розгляд відбувається без висновків"] -.- 4point_B
            4point_B["Пункт Б"] ==o 4main_com_pre["ГК попередньо розглядає законопроект, узагальнює зауваження і пропозиції"]
            4main_com_pre --> 4exp_conc["Висновки, експертні висновки, пропозиції"]

            4exp_conc --> |"За наявності підстав (ст. 94 ЗУ «Про Регламент Верховної Ради України»)"| 4head_VRU_return["Голова ВРУ (або його заступник) за поданням ГК або Погоджувальної ради повертають 3-т суб'єкту законодавчої ініціативи протягом ≥15 днів"]
            4exp_conc --> 4main_com_conc["Є висновок ГК з пропозицією включити з-т до порядку денного та супровідні матеріали в першому читанні"]
            4exp_conc --> |"Якщо протягом 30 днів відсутній висновок ГК"| 4law_subj["Суб'єкт законодавчої ініціативи письмово звертається до ВРУ"]

            4head_VRU_return --> 4main_com_return["Законопроект може бути повернуто до ГК після усунення недоліків"]
            4main_com_return --> 4to_point_B1["До пункту Б"]

            4main_com_conc --> |"Не пізніше 30 днів з дня отримання висновку ГК і не раніше 2-х днів після його надання народним депутатам"| 4VRU_accept1
            4VRU_accept1 --> |"<strong>Так</strong>"| 4law_accept1["3-т включений до Порядку денного"]
            4VRU_accept1["Прийняття рішення ВРУ про включення до порядку денного ≥226"] --> |"<strong>Ні</strong>"| 4to_point_C2["До пункту В"]
            4keep_cons["Прийняття рішення про продовження розгляду 3-ту ГК ≥226"] --> |"<strong>Ні</strong>"| 4law_reject
            4point_C["Пункт В"] ==o 4deputy_accept["Прийняття рішення про включення до порядку денного народними депутатами ≥226"]
            4deputy_accept --> |"<strong>Так</strong>"| 4first_reading1["На 1-е читання"]
            4deputy_accept --> |"<strong>Ні</strong>"| 4law_reject["3-т відхилено"]

            4get_30days["Не раніше 30 днів з дня отримання ГК з-ту для висновку"] -.- 4law_subj
            4law_subj --> |"15 днів"| 4VRU_accept2["ВРУ Приймає рішення про включення до порядку денного ≥226"]
            4VRU_accept2 --> |"<strong>Ні</strong>"| 4add_time["Надається додатковий час для підготовки висновку"]
            4add_time --> 4to_point_C1["До пункту В"]
            4VRU_accept2 --> |"<strong>Так</strong>"| 4law_accept2["3-т включений до Порядку денного"]
            4law_accept2 ----> 4first_reading1["На 1-е читання"]

            4no_conc_desc ~~~ 4law_14days
            4law_14days["Вноситься не пізніше, як на 14-й день після подання першого законопроекту народним депутатам"] -.- 4alt_law["Альтернативний законопроект"]
            4alt_law --> 4point_A["Пункт А"]


            class 4point_A,4point_B,4point_C,4to_point_B1,4to_point_C1,4to_point_C2,4law_14days,4no_conc_desc,4get_30days empty
            class 4point_A,4point_B,4point_C,4to_point_B1,4to_point_C1,4to_point_C2 bold

            class 4law_14days,4no_conc_desc italic

            style 4main_com_pre stroke-dasharray: 10 6

            end
        `,
        first: `
            5g:::bold
            5g:::title
            subgraph 5g["Перше читання з-ту - обговорення основних принципів, положень, критеріїв, структури законопроекту та прийняття його за основу"]
            direction TB

            5point_A["Пункт А"] ==o 5start
            5start["Розгляд в ГК при підготовці до 1-го читання за процедурою попереднього розгляду законопроектів"] ~~~ 5start_right
            5start_right["Включити як невідкладний (процедурне рішення 150)"] --> 5start
            5start_right --> 5start_right_bot
            5start ---> 5start_right_bot_bot["Невідкладні законопроекти включаються до порядку денного найближчого пленарного засідання i розглядаються позачергово ≥226"]
            5start --> 5start_left
            5start_left["Законопроект направляється до Головного науково-експертного управління Апарату ВРУ Висновки направляються ГК не 14 днів з дня надходження"] --> 5start
            5start --> 5start_left_bot["Перенесення розгляду законопроекту"]
            5start ---> 5start_bot
            5start_right_bot["Рішення ad hoc про відхилення від процедури розгляду з скороченням строків надання 3-ту депутатам не більше ніж наполовину"] --> 5start_right_bot_bot
            5start_bot["Законопроект та супровідні матеріали до нього роздаються для ознайомлення народним депутатам (не пізніше ніж за 7 днів до розгляду законопроекту ВРУ)"] --> 5start_bot_bot

            5start_bot_bot_comment["Розгляд проектів кодексів і з-тів які містять понад 100 статей можливий лише за повної процедури обговорення"] -.- 5start_bot_bot
            5start_bot_bot["Розгляд з-ту ВРУ у першому читанні (прийняття рішення за повною або скороченою процедурою)"] --> 51state_2
            51state_2["<strong>(1)</strong> Прийняття з-ту в першому читанні за основу доручення ГК підготувати з до другого читання"] --> |"<strong>Так</strong>"| 51state_1
            51state_1["Прийняття з-ту у 1-у читанні та в цілому"] --> |"<strong>Так</strong>"| 51_state1_yes["Підготовка з-у до направлення на підпис Президенту"]
            51state_1 --> |"<strong>Ні</strong>"| 51_state1_no
            51state_2 --> |"<strong>Так</strong>"| 51_state1_no
            51_state1_no["Народні депутати подають свої пропозиції та поправки до з-ту"] --> 52_state2_second["На друге читання"]

            51state_2 --> |"<strong>Ні</strong>"| 51state_3
            51state_3["<strong>(2)</strong> Повернення з-ту суб'єкту права законодавчої (повторне 1-е читання) ≥226"] --> 51state_34_yes["Внесення пропозицій до законопроекту (у 10-денний термін після попереднього першого читання)"]
            51state_34_yes --> 51state_34_2["Доопрацювання з-ту ГК"] --> 51state_34_3["Винесення з-ту на повторне перше читання (не пізніше 30-ти днів після його дня попереднього розгляду)"] --> 51state_34_4["Повторне перше читання з-тy"] --> 51state_34_A["До пункту А"]

            51state_3 --> |"<strong>Ні</strong>"| 51state_4
            51state_4_comment["В разі, якщо жодне з рішень 1, 2, 3, 4 не прийнято, з-т вважається відхиленим"] ~~~ 51state_4
            51state_4["<strong>(3)</strong> Направлення з-ту на доопрацювання до ГК (повторне 1-е читання)"] --> 51state_34_yes

            51state_4 --> |"<strong>Ні</strong>"| 51state_5
            51state_5["<strong>(4)</strong> Направлення з-ту для всенародного обговорення"] --> |"<strong>Так</strong>"| 51state_5_yes
            51state_5_yes["Публікація з-ту в друкованому органі, визначеному ВРУ"] --> 51state_5_2["Попередній розгляд та узагальнення пропозиції, зауважень, альтернативних з-тів комітетами ВРУ"] --> 51state_5_3["Узагальнення матеріалів та доопрацювання з-ту ГК"] --> 51state_34_4["Повторне перше читання з-ту"]

            51state_5 --> |"<strong>Ні</strong>"| 51state_rejected["З-т відхилено"]
            5start_bot_bot --> 51state_reject_try
            51state_reject_try["Відхилення з-ту"] --> |"<strong>Так</strong>"| 51state_rejected


            class 5point_A,51state_34_A,5start_bot_bot_comment,51state_4_comment bold
            class 5point_A,51state_34_A,5start_bot_bot_comment,51state_4_comment empty

            end
        `,
        second: `
            6g:::bold
            6g:::title
            subgraph 6g["Друге читання з-ту - постатейне обговорення і прийняття в другому читанні"]
            direction TB

            6s["Внесення поправок та пропозицій до з-ту (у 14-денний термін після прийняття у першому читанні)"] --> 6s_b
            6point_A["Пункт А"] ==o 6s_b
            6s_b["Підготовка з-ту ГК до другого читання (формування таблиці поправок та пропозицій). Візується головою і керівником секретаріату ГК"] --> 6s_b_l
            6s_b_l["3-т направляться до редакційного відділу Головного управління документального забезпечення Апарату ВРУ (для редакційного опрацювання). Висновки направляються до ГК не пізніше 14 днів з дня надходження"] --> 6s_b
            6s_b --> 6s_b_r
            6s_b_r["3-т направляється до головного юридичного управління Апарату ВРУ (для Проведення юридичної експертизи). Висновки направляються до ГК не пізніше 14 днів з дня надходження. Візується керівником управління"] --> 6s_b
            6s_b --> 6s_b_c_1

            6s_b_c_1_desc["ВРУ може прийняти процедурне рішення (≥150) щодо розгляду 3-му самостійними частинами після голосування пропозицій до статті, голосується сама стаття"] -.- 6s_b_c_1
            6s_b_c_1["3-т (у вигляді порівняльної таблиці з пропозиціями І поправками) та супровідні матеріали до нього надаються для ознайомлення народним депутатам (не пізніше ніж 10 днів до розгляду за законопроекту ВРУ)"] --> 6s_b_c_2
            6s_b_c_2_desc["За наполяганням депутата-автора відхиленої пропозиції вона обговорюється і за його бажанням голосується ≥226, за бажанням будь-якого депутата пропозиція, врахована ГК, обговорюється голосуються на 'підтвердження' ≥226"] -.- 6s_b_c_2
            6s_b_c_2["Розгляд з-ту ВРУ (постатейне голосування)"] --> 61_s

            61_s["Прийняття ВРУ рішення щодо з-ту в другому читання ≥226"] --> 61_s_1["Відхилення з-ту"] --> 61_s_1_2["З-т знімається з  розгляду"]
            61_s --> 61_s_2["Направлення з-ту до ГК на доопрацювання (повторне друге читання)"] --> 61_s_2_2["Внесення пропозицій та поправок у 10-денний термін"] --> 61_s_2_A["До пункту А"]
            61_s --> 61_s_3["Прийняття з-ту в другому читанні та в цілому"] --> 61_s_3_2["Підготовка з-ту до направлення на підпис Президенту"]
            61_s --> 61_s_4["Прийняття з-ту в другому читанні та доручення ГК підготувати з-т до третього читання"] --> 61_s_4_2["До ГК на третє читання"]

            class 6point_A,61_s_2_A bold
            class 6point_A,61_s_2_A,6s_b_c_1_desc,6s_b_c_2_desc empty

            end
        `,
        third: `
            7g:::bold
            7g:::title
            subgraph 7g["Третє читання з-ту прийняття з-ту, який потребує доопрацювання та узгодження, в цілому"]
            direction TB

            7s["Внесення поправок доз-ту (у 5-денний термін після другого читання)"] --> 7s_b
            7s_b["Підготовка э-ту до третього читання ГК (формування порівняльної таблиці). Візується головою і керівником секретаріату ГК"] --> 7s_b_l
            7s_b_l["З-т направляється до редакційного документального забезпечення Апарат ВРУ (для редакційного праця). Висновок направляються ГК не пізніше 14 днів з дня надходження з візою керівника"] --> 7s_b
            7s_b --> 7s_b_c
            7s_b --> 7s_b_r
            7s_b_r["3-т направляється до Головного юридичного управління Апарату ВРУ (для юридичної експертизи). Висновки направляються ГК не пізніше 14 днів з дня надходження з візою керівника"] --> 7s_b

            7s_b_c["3-т - порівняльна таблиця та супровідні матеріали надаються депутатам не пізніше ніж за 5 днів до розгляду у сесійній залі"] --> 7s_b_c_b
            7s_b_c_b["Розгляд з-ту: голосування статей, які зазнали змін після другого читання, голосування Постанови про схвалення плану КМУ заходів щодо введення закону в дію, голосування в цілому"] --> 71_s

            71_s["ВРУ приймає рішення - ≥226"] --> 71_s1
            71_s1["Перенесення голосування щодо законопроекту в цілому у зв'язку з прийняттям рішення про перенесення розгляду або до подання КМУ проектів актів, прийняття яких передбачено в з-ті"] --> 71_s

            71_s --> 71_s2
            71_s2_s_pre["У paзi виявлення порушень законодавчої процедури або неідентичності поданого на підпис тексту з-ту народний депутат у дводенний термін звертається до Голови ВРУ"] -.- 71_s2_s
            71_s2["Прийняття Закону в цілому"] --> 71_s2_1["Оформлення з-ту ГК у 10-денний термін 3 візами голови та керівника секретаріату ГК, керівника Головного юридичного управління та редакційного відділу Апарату ВРУ"] --> 71_s2_s
            71_s2_s["Голова ВРУ не раніше двох і не пізніше 5 днів з дня подання приймає рішення"] --> 71_s2_s_right
            71_s2_s --> 71_s2_s_bot
            71_s2_s_right["ВРУ розглядає з-т невідкладно у разі виявлення редакційних неточностей або явних неузгодженостей"] --> 71_s2_s_right_reject
            71_s2_s_right_reject["У разі відхилення усіх пропозицій"] --> 71_s2_s_bot["Голова ВРУ підписує закон і невідкладно направляє Президенту"]
            71_s2_s_right --> 71_s2_s_right_accept1
            71_s2_s_right_accept1["У разі прийняття хоча б однієї пропозиції"] --> 71_s2_s_right_sign
            71_s2_s_right_sign["ГК за участю Головного юридичного управління та редакційного відділу у 3-денний термін готують текст закону на підпис"] --> 71_s2_s_bot

            71_s --> 71_s3
            71_s3["Схвалення тексту з-ту в цілому і винесення його на всеукраїнський референдум"] --> 71_s3_ref
            71_s3_ref["Проведення референдуму, визначення його наслідків відповідно до Конституції та закону про референдум"] --> 71_s

            71_s --> 71_s_rejected["Відхилення з-ту"]
            71_s_rejected ~~~ 71_s_rejected_comment["У разі, якщо жодне з рішень 1, 2, 3 не отримало ≥226 голосів, з-т вважається відхиленим"]


            class 71_s_rejected_comment bold
            class 71_s_rejected_comment empty

            end
        `,
        valid: `
            8g:::bold
            8g:::title
            subgraph 8g["Розгляд Закону Президентом України Набрання законом чинності"]
            direction TB

            8s["Президент розглядає закон (протягом 15-ти днів)"] --> 8s_b3["Не повертає закон"]
            8s_b3 --> 8s_b3_2["Підписується і офіційно оприлюднюється Головою ВРУ"]

            8s --> 8s_b2["Підписує закон і офіційно оприлюднює протягом 10 днів"]

            8s --> 8s_b1["Накладає вето на закон і повертає його до ВРУ зі своїми пропозиціями"]
            8s_b1 --> 8s_b1_2["Скасовуються результати голосування і відкривається процедура повторного розгляду"] --> 8s_b1_3["Голова або його заступники можуть направити матеріали структурним підрозділам Апарату ВРУ для надання висновку, ГНЕУ"]
            8s_b1_3 --> 8s_b1_3_bot["ГК готує висновок і порівняльну таблицю (ГТ)"]
            8s_b1_3 --> 8s_b1_3_right["Головний комітет (ГК) розглядає матеріали"]
            8s_b1_3_right --> 8s_b1_3
            8s_b1_3_right --> 8s_b1_3_bot
            8s_b1_3_right -.-> 8s_b1_3_right_right["Інші комітети з власної ініціативи або за зверненням ГК розглядають і дають висновки у 10-денний термін"]
            8s_b1_3_right_right --> 8s_b1_3_right
            8s_b1_3_bot --> 8s_b1_3_bot_2["ГК направляє висновок, ПТ і супровідні матеріали депутатам ≤3 дні до розгляду на засіданні"]
            8s_b1_3_bot_2 --> 8s_b1_3_bot_3["Позачерговий розгляд на пленарному засіданні ВРУ"]
            8s_b1_3_bot_3_desc["Не пізніше 30 днів після повернення з-ту з пропозиціями Президента"] -.- 8s_b1_3_bot_3
            8s_b1_3_bot_3 --> 81_s["Розгляд пропозицій Президента"]

            81_s --> |"У разі якщо Президент пропонує відхилити закон"| 81_s_l["Прийняття рішення щодо відхилення закону - ≥226"]
            81_s_l --> |"<strong>Так</strong>"| 81_s_l_rejected["З-т відхилений"]
            81_s_l --> |"<strong>Ні</strong>"| 81_s_l_r["Закон приймається в цілому (≥300)"] --> 81_s_l_r_2["Підписується Головою ВРУ"] --> 81_s_l_r_3["Направляється повторно на підпис Президенту"] --> 81_s_l_r_A["До пункту А"]

            81_s --> |"У разі якщо Президент запропонував пропозиції щодо змін у Законі обговорення пропозицій за процедурними рішеннями - ≥150"| 81_s_r["Розгляд окремих пропозицій Президента"]
            81_s_r --> 81_s_r_1["Всі пропозиції прийняті ≥226"]
            81_s_r_1 --> 81_s_r_1_2["Прийняття в цілому (≥ 226)"] --> 81_s_r_123["У разі відхилення може бути відправлений на повторний розгляд"]
            81_s_r --> 81_s_r_2["Частина пропозицій приймається - ≥226, інші подолані - ≥300"]
            81_s_r_2 --> 81_s_r_23["Прийняття в цілому (≥300)"] --> 81_s_r_123
            81_s_r --> 81_s_r_3["Всі пропозиції подолані ≥300"]
            81_s_r_3 --> 81_s_r_23

            81_s_r_123 --> 81_s_r_123_2["Повторний розлад пропозицій Президента за попередньою процедурою ≤30 днів"]
            81_s_r_123_2 --> 81_s_r_123_2_no["Відхиляється"]
            81_s_r_123_2 --> 81_s_r_123_2_yes["Приймається"] --> 81_s_r_123_2_yes_2["Підписується Головою ВРУ"] --> 81_s_r_123_2_yes_3["Направляється повторно на підпис Президента"] --> 81_s_r_123_2_yes_A["До пункту А"]

            8point_A["Пункт А"] ==o 82_s["Президент повторно розглядає закон (протягом 15 днів)"]
            82_s --> 82_s_yes["Підписує закон і офіційно оприлюднює його протягом 10 днів"]
            82_s --> 82_s_no["Не підписує"] --> 82_s_no_2["Голова ВРУ невідкладно оприлюднює і опубліковує закон за своїм підписом"]


            class 8point_A,81_s_l_r_A,81_s_r_123_2_yes_A bold
            class 8point_A,81_s_l_r_A,81_s_r_123_2_yes_A,8s_b1_3_bot_3_desc empty

            end
        `,
        test: '81_s_r_3 --> 81_s_r_23\n81_s_r_33 --> 81_s_r_23'
    }
};